教科書審查修訂.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-13 Sun 15:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>國家教育研究院教科書審查意見表</title>
<meta name="author" content="Yung Chin, Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/white.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">國家教育研究院教科書審查意見表</h1>
<div id="outline-container-org66b6f8a" class="outline-2">
<h2 id="org66b6f8a"><span class="section-number-2">1.</span> 參考資料</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=7J7X7aZvMXQ">How do Computers Work? Exploring Computer Main Memory</a><br /></li>
<li><a href="https://www.youtube.com/watch?v=piF6D6CQxUw">How are memories stored in neural networks? | The Hopfield Network #SoME2 </a><br /></li>
<li><a href="https://www.gigabyte.com/tw/Glossary/gpu">GPU介紹 </a><br /></li>
</ul>
</div>
</div>

<div id="outline-container-org85b7bf4" class="outline-2">
<h2 id="org85b7bf4"><span class="section-number-2">2.</span> 一般基準/文本內容</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb697920" class="outline-3">
<h3 id="orgb697920"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> <code>[0/3]</code> 多處內容不完整，無法清楚呈現概念。教科書應能提供完整具脈絡的概念說明。例如：</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>3-4系統平台介紹元宇宙概念。但元宇宙蓋面甚廣，介紹稍嫌簡略。此外， p.150說明元宇宙的概念，其中並未說明區塊鏈，但p.151卻提到此專有名詞。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：增加元宇宙內容介紹以及區塊鏈概念簡介<br /></li>
<li>部分章節涵蓋許多較為進階的概念，但並未適切說明。例如，p.137介紹OS記憶體管理、VM與page fault等概念，但僅有一頁內容，學生是否能由該頁內容理解frame與page的定義？page fault產生的各種可能？記憶體置換的多種策略？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：增加VM，page, frame的說明<br /></li>
<li>第四章中巨量資料及資料探勘的處理流程及方法相似，建議適當釐清或整併連結。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：簡化資料探勘的流程說明，<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6876c28" class="outline-2">
<h2 id="org6876c28"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> <code>[0/3]</code> 一般基準/教學活動設計</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>部分內容偏向細瑣的知識陳述，宜加入思考與問題解決之學習活動，以培養學生運算思維。例如：第三章系統平台的內容。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：加入問題解決學習活動<br /></li>
<li>本書多章練習題皆在檢測學生記憶性知識，無法提供學生思考與問題解決的機會。例如：許多題目為專有名詞解釋或數位工具名稱的單選題。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：加入問題解決式試題<br /></li>
<li>第四章資料表示、處理及分析無實作設計，無法引導學生思考資料處理與分析的目的、策略與方法。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：將原本移至教師手冊的實作範例移至課文中<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orge74bdc1" class="outline-2">
<h2 id="orge74bdc1"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> <code>[0/2]</code> 一般基準/圖文表達</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>本書多處內容文句或邏輯不通順，應詳加校訂並潤飾。<br /></li>
<li>本書常整段文章，只有最後一個句號，其餘都是逗號，影響閱讀。如：p108；p.110；p.189第一段；p.211第一段全段11個逗號，一個句號；p.217第一段；p.220第一段；p.255第六章兩段前言；p.257正確性段落等；宜全書檢視修正。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：重新順稿<br /></li>
<li>本書多處圖片未於內文有適切的引用或文字對應說明。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：檢視所有圖片<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org2e2a6da" class="outline-2">
<h2 id="org2e2a6da"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> <code>[0/1]</code> 一般基準/編寫體例</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>建議本書於書末加入圖表及中英文詞彙關鍵字索引，以利學生學習。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依修訂建議<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org8d5fb23" class="outline-2">
<h2 id="org8d5fb23"><span class="section-number-2">6.</span> 各章節問題</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org1f307f2" class="outline-3">
<h3 id="org1f307f2"><span class="section-number-3">6.1.</span> <span class="todo TODO">TODO</span> <code>[0/4]</code> 第三章 系統平台</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>部份內容以學生未學過的知識作為例子。如：p.120學生知道何為COBOL或是FORTRAN嗎？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 加註COBOL/FORTRAN介紹，此例中若以其他學生熟知的語言(C/C++)替代並不合理<br /></li>
<li>部份內容以學生未知之專有名詞進行說明。如：p.113 Cache L1~L3、Northbridge、p.129 BIOS與CMOS。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：簡化p113圖片，將BIOS與CMOS加入名詞解釋<br /></li>
<li>部分內容涵蓋進階的概念，但並未適切說明，如p.137 OS記憶體管理、VM與page fault等。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：增加VM，page, frame的說明<br /></li>
<li>內容多為知識陳述，無法引導學生思考系統平台的演進脈絡及運作原理。宜提供學生思考、應用、動手實作之機會，以培養學生運算思維與問題解決。例如：引導學生觀察自己電腦正在執行的行程與資源的使用狀況。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：加入問題解決式試題及範例(觀察記憶體與CPU使用情形，解決問題)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8ba71c4" class="outline-3">
<h3 id="org8ba71c4"><span class="section-number-3">6.2.</span> <span class="todo TODO">TODO</span> <code>[0/5]</code> 第四章 資料表示、處理及分析</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>部分內容有誤且不一致，宜全面檢視修正。例如：5V理論，p.161、p.163與圖4-1三處並不一致。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂:相關用語改為一致化<br /></li>
<li>部分專有名詞第一次出現時未解釋。例如：p.171協作式過濾（Collaborative Filtering, CF），p.180圖中CNN, RNN, DNN，p.184決策樹，p.252邏輯迴歸、k-近鄰演算法等專有名詞。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 加入名詞解釋<br /></li>
<li>多處內容流於知識陳述，無法引導學生思考資料處理與分析的目的、策略與方法。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 歸納資料處理分析的流程、說明如何面對、處理新資枓<br /></li>
<li>巨量資料及資料探勘的處理流程及方法說明相似，建議適當釐清或整併連結。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：簡化資料探勘的流程說明，<br /></li>
<li>多處內容文意不清或內容不適當，例如p.183：<br /></li>
<li>「已經有部分的分析依據，所以其效果較非監督式學習好。」：與非監督式學習相較，半監督式學習可以得到什麼比較好的效果？為什麼？<br /></li>
<li>「我們以為Gmail很好心的提供給我們…其實是Google利用我們當免費勞工…」：說明是否合適？<br /></li>
<li>「半監督式學習一方面解決了這個問題，…也可提供較非監督式學習準確的預測能力。」：半監督式學習有完整解決問題嗎？又為何與非監督式學習比較預測能力？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：重新順稿<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org032498e" class="outline-2">
<h2 id="org032498e"><span class="section-number-2">7.</span> <span class="todo TODO">TODO</span> <code>[0/42]</code> 依頁數建議細部修訂</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>P.107: 文句不通順，邏輯不清。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：重新順稿<br /></li>
<li>P.108 <i>2</i>: 何謂系統平台的濫觴？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：濫觴為起源/開端之意，為免爭議，可以改為 系統平台的起源<br /></li>
<li>P.108 <i>-1,-2</i>: 「石器時代…極無效率」：應避免主觀、武斷的說法。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：依建議修正<br /></li>
<li>P.108-127: 內容多為細瑣的背誦性知識，未能引導學生思考系統平台的發展脈絡。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：加入問題解決式試題及範例(觀察記憶體與CPU使用情形，解決問題)<br /></li>
<li>P.110 <i>1</i>: 上段僅剩9字 列於本頁，建議整併至上頁。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：依建議修正<br /></li>
<li>P.110 <i>3</i>: 「如前節所述，系統平台包含電腦硬體與作業系統…&#x2026;」：前節何處提到作業系統？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：重新順稿<br /></li>
<li>P.110 <i>14</i>: 何謂「批次」？於p.120才有較詳細之解說。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：重新順稿<br /></li>
<li>P.111 <i>圖3-6</i>: 此圖並無法清楚說明指令集架構。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新畫圖<br /></li>
<li>P.113 <i>圖3-9</i>: 本圖有太多未說明之英文專有名詞，如cache L1~L3、northbridge、Hyper…..<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：簡化p113圖片，將BIOS與CMOS加入名詞解釋<br /></li>
<li>P.114/1-7/: 說明不清楚。運算工作分別丟給兩個核心，是指兩個指令分別給兩個核心運算嗎？應說明何謂「一個工作」。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：重新順稿<br /></li>
<li>P.115 <i>3</i>: GPU俗稱顯示卡？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿，改為「圖形處理器」。<br /></li>
<li>P.115 <i>圖3-12</i>: 學生看這個圖就能明瞭CPU與GPU的差異嗎？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：補充差異<br /></li>
<li>P.120 <i>圖3-21</i>: 以學生未學過的知識作為例子。學生知道COBOL、FORTRAN嗎？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 加註COBOL/FORTRAN介紹，此例中若以其他學生熟知的語言(C/C++)替代並不合理<br /></li>
<li>P.128 <i>圖3-36</i>: 本圖看不出使用者、應用程式、作業系統、硬體間之「關係」。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新畫圖<br /></li>
<li>P.129 <i>7</i>: 何謂BIOS？何謂CMOS？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：簡化p113圖片，將BIOS與CMOS加入名詞解釋<br /></li>
<li>P.132 <i>圖</i>: 行程狀態是否為重要概念？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 比對其他版本教科書，評估是否移除此概念<br /></li>
<li>P.133 <i>I百科</i>: Long-term scheduler等是重要概念嗎？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 比對其他版本教科書，評估是否移除此概念<br /></li>
<li>P.134-136 <i>圖</i>: 宜避免中英夾雜。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿<br /></li>
<li>P.139 <i>圖</i>: 內文之說明不夠清楚。何處是實體記憶體？何處是交換空間？分頁表在何處？何處有連續的記憶體空間？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 補充說明圖文對照<br /></li>
<li>P.141,144 <i>圖</i>: 未於內文提供清楚的對照說明。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 補充說明圖文對照<br /></li>
<li>P.151 <i>-3</i>: 本處提到區塊鏈但未說明。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：增加元宇宙內容介紹以及區塊鏈概念簡介<br /></li>
<li>P.152-155: 題目多在檢驗學生記憶性知識，無法引導學生思考與問題解決。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂：加入問題解決式、引導式內容<br /></li>
<li>P.161 <i>-1</i>: 「變化性（Variability）」：內文中的5V包含變化性(Variability)，與圖4-1的5V包含Veracity，資料存在真實性問題，不一致。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 統一用詞<br /></li>
<li>P.163 <i>-10</i>: 標題為Veracity，5V到底包含哪五V，請統一。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 統一用詞<br /></li>
<li>P.164 <i>11</i>: 「資料又…在新增」：文句不通順。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿<br /></li>
<li>P.171 <i>-13</i>: 協作式過濾（Collaborative Filtering, CF）：其意涵？學生恐難理解。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 補充說明CF<br /></li>
<li>P.171 <i>2</i>: 「實際上…不遙遠」：文句不通順。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿<br /></li>
<li>P.172 <i>12</i>: 「美國加洲…」：錯別字。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿<br /></li>
<li>P.176 <i>-7</i>: 「如圖4-5的黑盒子」「如圖4-4的黑盒子」。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.180 <i>圖4-19</i>: 圖中的CNN, RNN, DNN專有名詞並無解釋。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂:<br /></li>
<li>P.180 <i>-2</i>: 「…Hinton 與兩立學生成立的….」&#x2013;&gt;兩位。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.184 <i>3</i>: 決策樹：其意涵？學生恐難理解。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂:<br /></li>
<li>P.184 <i>3</i>: 「本節以辨貓/狗為例….」&#x2013;&gt;「本節以分辨貓/狗為例….」。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.186 <i>3</i>: 「變的十分龐大」&#x2013;&gt;「變得十分龐大」。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.187 <i>-3</i> 重新計算k個中心點x 標題不精確。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿<br /></li>
<li>P.188 <i>1-4</i>: 此範例計算錯誤。<br />
<ul class="org-ul">
<li>P.188 <i>1</i>: 「新x值2+3+6+7/4=4.5 」&#x2013;&gt;「新x值2+3+4+6+7+9/6=…. 」。<br /></li>
<li>P.188 <i>2</i>: 「新y值6+5+3+6/4=5.00 」&#x2013;&gt;「新x值6+5+8+3+6+4/6=…. 」。<br /></li>
<li>P.188 <i>3</i>: 「新x值1+4+8+9/4=5.5 」&#x2013;&gt;「新x值1+8/2=…. 」。<br /></li>
<li>P.188 <i>4</i>: 「新x值9+8+8+4/4=7.25 」&#x2013;&gt;「新x值9+8/2=…. 」。<br /></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.188 <i>圖4-26</i>: 要隨前面修正。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.188 <i>7</i>: 「….新中心點(4.5,5.0)、(5.5,7.25)」&#x2013;&gt;請計算正確後修正。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
<li>P.189 <i>-8</i>: 「哪些種統計方法」：文詞不通順。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿<br /></li>
<li>P.190 <i>-7</i>: 「也是一種由結果導出原因的歸納過程」：文意不清，回歸方法可以由結果導出原因？<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 重新順稿                       竹人<br /></li>
<li>P.193: 本章習題較多記憶題及測驗軟體工具，應增加引導學生思考或問題解決題目。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂:<br /></li>
<li>P.198: 課堂練習2：第一題選用p.188第一輪分群結果繼續往下做第二輪，但p.188需整個改寫，請隨之更正。<br /></li>
<li class="off"><code>[&#xa0;]</code> 修訂: 依建議修正<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org4d53084" class="outline-2">
<h2 id="org4d53084"><span class="section-number-2">8.</span> Resource</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://www.eventx.io/zh/blog/metaverse">元宇宙是什麼？一篇文帶你看懂它可能帶來的商機、應用，以及面臨的爭議與挑戰</a><br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yung Chin, Yen</p>
<p class="date">Created: 2022-11-13 Sun 15:30</p>
</div>
</body>
</html>
